# Source Generated with Decompyle++
# File: data.cpython-310.pyc (Python 3.10)

a1 = [
    '子孙子水',
    '妻财寅木',
    '父母辰土',
    '官鬼午火',
    '兄弟申金',
    '父母戌土',
    6,
    3,
    '六冲',
    '',
    '乾宫',
    '乾为天']
a2 = [
    '父母丑土',
    '子孙亥水',
    '兄弟酉金',
    '官鬼午火',
    '兄弟申金',
    '父母戌土',
    1,
    4,
    '',
    '',
    '乾宫',
    '天风姤']
a3 = [
    '父母辰土',
    '官鬼午火',
    '兄弟申金',
    '官鬼午火',
    '兄弟申金',
    '父母戌土',
    2,
    5,
    '',
    '',
    '乾宫',
    '天山遁']
a4 = [
    '父母未土',
    '官鬼巳火',
    '妻财卯木',
    '官鬼午火',
    '兄弟申金',
    '父母戌土',
    3,
    6,
    '六合',
    '',
    '乾宫',
    '天地否']
a5 = [
    '父母未土',
    '官鬼巳火',
    '妻财卯木',
    '父母未土',
    '官鬼巳火',
    '妻财卯木',
    4,
    1,
    '',
    '',
    '乾宫',
    '风地观']
a6 = [
    '父母未土',
    '官鬼巳火',
    '妻财卯木',
    '父母戌土',
    '子孙子水',
    '妻财寅木',
    5,
    2,
    '',
    '',
    '乾宫',
    '山地剥']
a7 = [
    '父母未土',
    '官鬼巳火',
    '妻财卯木',
    '兄弟酉金',
    '父母未土',
    '官鬼巳火',
    4,
    1,
    '',
    '游魂卦',
    '乾宫',
    '火地晋']
a8 = [
    '子孙子水',
    '妻财寅木',
    '父母辰土',
    '兄弟酉金',
    '父母未土',
    '官鬼巳火',
    3,
    6,
    '',
    '归魂卦',
    '乾宫',
    '火天大有']
b1 = [
    '官鬼巳火',
    '妻财卯木',
    '父母丑土',
    '子孙亥水',
    '兄弟酉金',
    '父母未土',
    6,
    3,
    '六冲',
    '',
    '兑宫',
    '兑为泽']
b2 = [
    '妻财寅木',
    '父母辰土',
    '官鬼午火',
    '子孙亥水',
    '兄弟酉金',
    '父母未土',
    1,
    4,
    '六合',
    '',
    '兑宫',
    '泽水困']
b3 = [
    '父母未土',
    '官鬼巳火',
    '妻财卯木',
    '子孙亥水',
    '兄弟酉金',
    '父母未土',
    2,
    5,
    '',
    '',
    '兑宫',
    '泽地萃']
b4 = [
    '父母辰土',
    '官鬼午火',
    '兄弟申金',
    '子孙亥水',
    '兄弟酉金',
    '父母未土',
    3,
    6,
    '',
    '',
    '兑宫',
    '泽山咸']
b5 = [
    '父母辰土',
    '官鬼午火',
    '兄弟申金',
    '兄弟申金',
    '父母戌土',
    '子孙子水',
    4,
    1,
    '',
    '',
    '兑宫',
    '水山蹇']
b6 = [
    '父母辰土',
    '官鬼午火',
    '兄弟申金',
    '父母丑土',
    '子孙亥水',
    '兄弟酉金',
    5,
    2,
    '',
    '',
    '兑宫',
    '地山谦']
b7 = [
    '父母辰土',
    '官鬼午火',
    '兄弟申金',
    '官鬼午火',
    '兄弟申金',
    '父母戌土',
    4,
    1,
    '',
    '游魂卦',
    '兑宫',
    '雷山小过']
b8 = [
    '官鬼巳火',
    '妻财卯木',
    '父母丑土',
    '官鬼午火',
    '兄弟申金',
    '父母戌土',
    3,
    6,
    '',
    '归魂卦',
    '兑宫',
    '雷泽归妹']
c1 = [
    '父母卯木',
    '子孙丑土',
    '官鬼亥水',
    '妻财酉金',
    '子孙未土',
    '兄弟巳火',
    6,
    3,
    '六冲',
    '',
    '离宫',
    '离为火']
c2 = [
    '子孙丑土',
    '官鬼亥水',
    '妻财申金',
    '妻财酉金',
    '子孙未土',
    '兄弟巳火',
    1,
    4,
    '六合',
    '',
    '离宫',
    '火山旅']
c3 = [
    '子孙丑土',
    '官鬼亥水',
    '妻财酉金',
    '妻财酉金',
    '子孙未土',
    '兄弟巳火',
    2,
    5,
    '',
    '',
    '离宫',
    '火风鼎']
c4 = [
    '父母寅木',
    '子孙辰土',
    '兄弟午火',
    '妻财酉金',
    '子孙未土',
    '兄弟巳火',
    3,
    6,
    '',
    '',
    '离宫',
    '火水未济']
c5 = [
    '父母寅木',
    '子孙辰土',
    '兄弟午火',
    '子孙戌土',
    '官鬼子水',
    '父母寅木',
    4,
    1,
    '',
    '',
    '离宫',
    '山水蒙']
c6 = [
    '父母寅木',
    '子孙辰土',
    '兄弟午火',
    '子孙未土',
    '兄弟巳火',
    '父母卯木',
    5,
    2,
    '',
    '',
    '离宫',
    '风水涣']
c7 = [
    '父母寅木',
    '子孙辰土',
    '兄弟午火',
    '兄弟午火',
    '妻财申金',
    '子孙戌土',
    4,
    1,
    '',
    '游魂卦',
    '离宫',
    '天水讼']
c8 = [
    '父母卯木',
    '子孙辰土',
    '官鬼亥水',
    '兄弟午火',
    '妻财申金',
    '子孙戌土',
    3,
    6,
    '',
    '归魂卦',
    '离宫',
    '天火同人']
d1 = [
    '父母子水',
    '兄弟寅木',
    '妻财辰土',
    '子孙午火',
    '官鬼申金',
    '妻财戌土',
    6,
    3,
    '六冲',
    '',
    '震宫',
    '震为雷']
d2 = [
    '妻财未土',
    '子孙巳火',
    '兄弟卯木',
    '子孙午火',
    '官鬼申金',
    '妻财戌土',
    1,
    4,
    '六合',
    '',
    '震宫',
    '雷地豫']
d3 = [
    '兄弟寅木',
    '妻财辰土',
    '子孙午火',
    '子孙午火',
    '官鬼申金',
    '妻财戌土',
    2,
    5,
    '',
    '',
    '震宫',
    '雷水解']
d4 = [
    '妻财丑土',
    '父母亥水',
    '官鬼酉金',
    '子孙午火',
    '官鬼申金',
    '妻财戌土',
    3,
    6,
    '',
    '',
    '震宫',
    '雷风恒']
d5 = [
    '妻财辰土',
    '子孙午火',
    '官鬼申金',
    '妻财丑土',
    '父母亥水',
    '兄弟酉金',
    3,
    6,
    '',
    '',
    '震宫',
    '地风升']
d6 = [
    '妻财辰土',
    '父母亥水',
    '官鬼酉金',
    '官鬼申金',
    '妻财戌土',
    '父母子水',
    5,
    2,
    '',
    '',
    '震宫',
    '水风井']
d7 = [
    '妻财丑土',
    '父母亥水',
    '官鬼酉金',
    '父母亥水',
    '官鬼酉金',
    '妻财未土',
    4,
    1,
    '',
    '游魂卦',
    '震宫',
    '泽风大过']
d8 = [
    '父母子水',
    '兄弟寅木',
    '妻财辰土',
    '父母亥水',
    '官鬼酉金',
    '妻财未土',
    3,
    6,
    '',
    '归魂卦',
    '震宫',
    '泽雷随']
e1 = [
    '妻财丑土',
    '父母亥水',
    '官鬼酉金',
    '妻财未土',
    '子孙巳火',
    '兄弟卯木',
    6,
    3,
    '六冲',
    '',
    '巽宫',
    '巽为风']
e2 = [
    '父母子水',
    '兄弟寅木',
    '妻财辰土',
    '妻财未土',
    '子孙巳火',
    '兄弟卯木',
    1,
    4,
    '',
    '',
    '巽宫',
    '风天小畜']
e3 = [
    '兄弟卯木',
    '妻财丑土',
    '父母亥水',
    '妻财未土',
    '子孙巳火',
    '兄弟卯木',
    2,
    5,
    '',
    '',
    '巽宫',
    '风火家人']
e4 = [
    '父母子水',
    '兄弟寅木',
    '妻财辰土',
    '妻财未土',
    '子孙巳火',
    '兄弟卯木',
    3,
    6,
    '',
    '',
    '巽宫',
    '风雷益']
e5 = [
    '父母子水',
    '兄弟寅木',
    '妻财辰土',
    '子孙午火',
    '官鬼申金',
    '妻财戌土',
    4,
    1,
    '六冲',
    '',
    '巽宫',
    '天雷无妄']
e6 = [
    '父母子水',
    '兄弟寅木',
    '妻财辰土',
    '官鬼酉金',
    '妻财未土',
    '子孙巳火',
    5,
    2,
    '',
    '',
    '巽宫',
    '火雷噬嗑']
e7 = [
    '父母子水',
    '兄弟寅木',
    '妻财辰土',
    '妻财戌土',
    '父母子水',
    '兄弟寅木',
    4,
    1,
    '',
    '游魂卦',
    '巽宫',
    '山雷颐']
e8 = [
    '妻财丑土',
    '父母亥水',
    '官鬼酉金',
    '妻财戌土',
    '父母子水',
    '兄弟寅木',
    3,
    6,
    '',
    '归魂卦',
    '巽宫',
    '山风蛊']
f1 = [
    '子孙寅木',
    '官鬼辰土',
    '妻财午火',
    '父母申金',
    '官鬼戌土',
    '兄弟子水',
    6,
    3,
    '六冲',
    '',
    '坎宫',
    '坎为水']
f2 = [
    '妻财巳火',
    '子孙卯木',
    '官鬼丑土',
    '父母申金',
    '官鬼戌土',
    '兄弟子水',
    1,
    4,
    '六合',
    '',
    '坎宫',
    '水泽节']
f3 = [
    '兄弟子水',
    '子孙寅木',
    '官鬼辰土',
    '父母申金',
    '官鬼戌土',
    '兄弟子水',
    2,
    5,
    '',
    '',
    '坎宫',
    '水雷屯']
f4 = [
    '子孙卯木',
    '官鬼丑土',
    '兄弟亥水',
    '父母申金',
    '官鬼戌土',
    '兄弟子水',
    3,
    6,
    '',
    '',
    '坎宫',
    '水火既济']
f5 = [
    '子孙卯木',
    '官鬼丑土',
    '兄弟亥水',
    '兄弟亥水',
    '父母酉金',
    '官鬼未土',
    4,
    1,
    '',
    '',
    '坎宫',
    '泽火革']
f6 = [
    '子孙卯木',
    '官鬼丑土',
    '兄弟亥水',
    '妻财午火',
    '父母申金',
    '官鬼戌土',
    5,
    2,
    '',
    '',
    '坎宫',
    '雷火丰']
f7 = [
    '子孙卯木',
    '官鬼丑土',
    '兄弟亥水',
    '官鬼丑土',
    '兄弟亥水',
    '父母酉金',
    4,
    1,
    '',
    '游魂卦',
    '坎宫',
    '地火明夷']
f8 = [
    '子孙寅木',
    '官鬼辰土',
    '妻财午火',
    '官鬼丑土',
    '兄弟亥水',
    '父母酉金',
    3,
    6,
    '',
    '归魂卦',
    '坎宫',
    '地水师']
g1 = [
    '兄弟辰土',
    '父母午火',
    '子孙申金',
    '兄弟戌土',
    '妻财子水',
    '官鬼寅木',
    6,
    3,
    '六冲',
    '',
    '艮宫',
    '艮为山']
g2 = [
    '官鬼卯木',
    '兄弟丑土',
    '妻财亥水',
    '兄弟戌土',
    '妻财子水',
    '官鬼寅木',
    1,
    4,
    '六合',
    '',
    '艮宫',
    '山火贲']
g3 = [
    '妻财子水',
    '官鬼寅木',
    '兄弟辰土',
    '兄弟戌土',
    '妻财子水',
    '官鬼寅木',
    2,
    5,
    '',
    '',
    '艮宫',
    '山天大畜']
g4 = [
    '父母巳火',
    '官鬼卯木',
    '兄弟丑土',
    '兄弟戌土',
    '妻财子水',
    '官鬼寅木',
    3,
    6,
    '',
    '',
    '艮宫',
    '山泽损']
g5 = [
    '父母巳火',
    '官鬼卯木',
    '兄弟丑土',
    '子孙酉金',
    '兄弟未土',
    '父母巳火',
    4,
    1,
    '',
    '',
    '艮宫',
    '火泽睽']
g6 = [
    '父母巳火',
    '官鬼卯木',
    '兄弟丑土',
    '父母午火',
    '子孙申金',
    '兄弟戌土',
    5,
    2,
    '',
    '',
    '艮宫',
    '天泽履']
g7 = [
    '父母巳火',
    '官鬼卯木',
    '兄弟丑土',
    '兄弟未土',
    '父母巳火',
    '官鬼卯木',
    4,
    1,
    '',
    '游魂卦',
    '艮宫',
    '风泽中孚']
g8 = [
    '兄弟辰土',
    '父母午火',
    '子孙申金',
    '兄弟未土',
    '父母巳火',
    '官鬼卯木',
    3,
    6,
    '',
    '归魂卦',
    '艮宫',
    '风山渐']
h1 = [
    '兄弟未土',
    '父母巳火',
    '官鬼卯木',
    '兄弟丑土',
    '妻财亥水',
    '子孙酉金',
    1,
    4,
    '六冲',
    '',
    '坤宫',
    '坤为地']
h2 = [
    '妻财子水',
    '官鬼寅木',
    '兄弟辰土',
    '兄弟丑土',
    '妻财亥水',
    '子孙酉金',
    6,
    3,
    '六合',
    '',
    '坤宫',
    '地雷复']
h3 = [
    '父母巳火',
    '官鬼卯木',
    '兄弟丑土',
    '兄弟丑土',
    '妻财亥水',
    '子孙酉金',
    2,
    5,
    '',
    '',
    '坤宫',
    '地泽临']
h4 = [
    '妻财子水',
    '官鬼寅木',
    '兄弟辰土',
    '兄弟丑土',
    '妻财亥水',
    '子孙酉金',
    3,
    6,
    '六合',
    '',
    '坤宫',
    '地天泰']
h5 = [
    '妻财子水',
    '官鬼寅木',
    '兄弟辰土',
    '父母午火',
    '子孙申金',
    '兄弟戌土',
    4,
    1,
    '六冲',
    '',
    '坤宫',
    '雷天大壮']
h6 = [
    '妻财子水',
    '官鬼寅木',
    '兄弟辰土',
    '妻财亥水',
    '子孙酉金',
    '兄弟未土',
    5,
    2,
    '',
    '',
    '坤宫',
    '泽天夬']
h7 = [
    '妻财子水',
    '官鬼寅木',
    '兄弟辰土',
    '子孙申金',
    '兄弟戌土',
    '妻财子水',
    4,
    1,
    '',
    '游魂卦',
    '坤宫',
    '水天需']
h8 = [
    '兄弟未土',
    '父母巳火',
    '官鬼卯木',
    '子孙申金',
    '兄弟戌土',
    '妻财子水',
    3,
    6,
    '',
    '归魂卦',
    '坤宫',
    '水地比']
A1 = [
    '',
    '',
    '',
    '',
    '',
    '']
A2 = [
    '',
    '妻财寅木',
    '',
    '',
    '',
    '']
A3 = [
    '子孙子水',
    '妻财寅木',
    '',
    '',
    '',
    '']
A4 = [
    '子孙子水',
    '',
    '',
    '',
    '',
    '']
A5 = [
    '子孙子水',
    '',
    '',
    '',
    '兄弟申金',
    '']
A6 = [
    '',
    '',
    '',
    '',
    '兄弟申金',
    '']
A7 = [
    '子孙子水',
    '',
    '',
    '',
    '',
    '']
A8 = [
    '',
    '',
    '',
    '',
    '',
    '']
B1 = [
    '',
    '',
    '',
    '',
    '',
    '']
B2 = [
    '',
    '',
    '',
    '',
    '',
    '']
B3 = [
    '',
    '',
    '',
    '',
    '',
    '']
B4 = [
    '',
    '妻财卯木',
    '',
    '',
    '',
    '']
B5 = [
    '',
    '妻财卯木',
    '',
    '',
    '',
    '']
B6 = [
    '',
    '妻财卯木',
    '',
    '',
    '',
    '']
B7 = [
    '',
    '妻财卯木',
    '',
    '子孙亥水',
    '',
    '']
B8 = [
    '',
    '',
    '',
    '子孙亥水',
    '',
    '']
C1 = [
    '',
    '',
    '',
    '',
    '',
    '']
C2 = [
    '父母卯木',
    '',
    '官鬼亥水',
    '',
    '',
    '']
C3 = [
    '父母卯木',
    '',
    '',
    '',
    '',
    '']
C4 = [
    '',
    '',
    '官鬼亥水',
    '',
    '',
    '']
C5 = [
    '',
    '',
    '',
    '妻财酉金',
    '',
    '']
C6 = [
    '',
    '',
    '官鬼亥水',
    '妻财酉金',
    '',
    '']
C7 = [
    '',
    '',
    '官鬼亥水',
    '',
    '',
    '']
C8 = [
    '',
    '',
    '',
    '',
    '',
    '']
D1 = [
    '',
    '',
    '',
    '',
    '',
    '']
D2 = [
    '父母子水',
    '',
    '',
    '',
    '',
    '']
D3 = [
    '父母子水',
    '',
    '',
    '',
    '',
    '']
D4 = [
    '',
    '兄弟寅木',
    '',
    '',
    '',
    '']
D5 = [
    '',
    '兄弟寅木',
    '',
    '子孙午火',
    '',
    '']
D6 = [
    '',
    '兄弟寅木',
    '',
    '子孙午火',
    '',
    '']
D7 = [
    '',
    '兄弟寅木',
    '',
    '子孙午火',
    '',
    '']
D8 = [
    '',
    '',
    '',
    '子孙午火',
    '',
    '']
E1 = [
    '',
    '',
    '',
    '',
    '',
    '']
E2 = [
    '',
    '',
    '官鬼酉金',
    '',
    '',
    '']
E3 = [
    '',
    '',
    '官鬼酉金',
    '',
    '',
    '']
E4 = [
    '',
    '',
    '官鬼酉金',
    '',
    '',
    '']
E5 = [
    '',
    '',
    '',
    '',
    '',
    '']
E6 = [
    '',
    '',
    '',
    '',
    '',
    '']
E7 = [
    '',
    '',
    '官鬼酉金',
    '',
    '子孙巳火',
    '']
E8 = [
    '',
    '',
    '',
    '',
    '子孙巳火',
    '']
F1 = [
    '',
    '',
    '',
    '',
    '',
    '']
F2 = [
    '',
    '',
    '',
    '',
    '',
    '']
F3 = [
    '',
    '',
    '妻财午火',
    '',
    '',
    '']
F4 = [
    '',
    '',
    '妻财午火',
    '',
    '',
    '']
F5 = [
    '',
    '',
    '妻财午火',
    '',
    '',
    '']
F6 = [
    '',
    '',
    '',
    '',
    '',
    '']
F7 = [
    '',
    '',
    '妻财午火',
    '',
    '',
    '']
F8 = [
    '',
    '',
    '',
    '',
    '',
    '']
G1 = [
    '',
    '',
    '',
    '',
    '',
    '']
G2 = [
    '',
    '父母午火',
    '子孙申金',
    '',
    '',
    '']
G3 = [
    '兄弟辰土',
    '父母午火',
    '',
    '',
    '',
    '']
G4 = [
    '',
    '',
    '子孙申金',
    '',
    '',
    '']
G5 = [
    '',
    '',
    '子孙申金',
    '',
    '妻财子水',
    '']
G6 = [
    '',
    '',
    '',
    '',
    '妻财子水',
    '']
G7 = [
    '',
    '',
    '子孙申金',
    '',
    '妻财子水',
    '']
G8 = [
    '',
    '',
    '',
    '',
    '妻财子水',
    '']
H1 = [
    '',
    '',
    '',
    '',
    '',
    '']
H2 = [
    '',
    '父母巳火',
    '',
    '',
    '',
    '']
H3 = [
    '',
    '',
    '',
    '',
    '',
    '']
H4 = [
    '',
    '父母巳火',
    '',
    '',
    '',
    '']
H5 = [
    '',
    '',
    '',
    '',
    '',
    '']
H6 = [
    '',
    '父母巳火',
    '',
    '',
    '',
    '']
H7 = [
    '',
    '父母巳火',
    '',
    '',
    '',
    '']
H8 = [
    '',
    '',
    '',
    '',
    '',
    '']
# WARNING: Decompyle incomplete


# Recovered from pyc
gua64 = {'111111': ['子孙子水', '妻财寅木', '父母辰土', '官鬼午火', '兄弟申金', '父母戌土', 6, 3, '六冲', '', '乾宫', '乾为天'], '211111': ['父母丑土', '子孙亥水', '兄弟酉金', '官鬼午火', '兄弟申金', '父母戌土', 1, 4, '', '', '乾宫', '天风姤'], '221111': ['父母辰土', '官鬼午火', '兄弟申金', '官鬼午火', '兄弟申金', '父母戌土', 2, 5, '', '', '乾宫', '天山遁'], '222111': ['父母未土', '官鬼巳火', '妻财卯木', '官鬼午火', '兄弟申金', '父母戌土', 3, 6, '六合', '', '乾宫', '天地否'], '222211': ['父母未土', '官鬼巳火', '妻财卯木', '父母未土', '官鬼巳火', '妻财卯木', 4, 1, '', '', '乾宫', '风地观'], '222221': ['父母未土', '官鬼巳火', '妻财卯木', '父母戌土', '子孙子水', '妻财寅木', 5, 2, '', '', '乾宫', '山地剥'], '222121': ['父母未土', '官鬼巳火', '妻财卯木', '兄弟酉金', '父母未土', '官鬼巳火', 4, 1, '', '游魂卦', '乾宫', '火地晋'], '111121': ['子孙子水', '妻财寅木', '父母辰土', '兄弟酉金', '父母未土', '官鬼巳火', 3, 6, '', '归魂卦', '乾宫', '火天大有'], '112112': ['官鬼巳火', '妻财卯木', '父母丑土', '子孙亥水', '兄弟酉金', '父母未土', 6, 3, '六冲', '', '兑宫', '兑为泽'], '212112': ['妻财寅木', '父母辰土', '官鬼午火', '子孙亥水', '兄弟酉金', '父母未土', 1, 4, '六合', '', '兑宫', '泽水困'], '222112': ['父母未土', '官鬼巳火', '妻财卯木', '子孙亥水', '兄弟酉金', '父母未土', 2, 5, '', '', '兑宫', '泽地萃'], '221112': ['父母辰土', '官鬼午火', '兄弟申金', '子孙亥水', '兄弟酉金', '父母未土', 3, 6, '', '', '兑宫', '泽山咸'], '221212': ['父母辰土', '官鬼午火', '兄弟申金', '兄弟申金', '父母戌土', '子孙子水', 4, 1, '', '', '兑宫', '水山蹇'], '221222': ['父母辰土', '官鬼午火', '兄弟申金', '父母丑土', '子孙亥水', '兄弟酉金', 5, 2, '', '', '兑宫', '地山谦'], '221122': ['父母辰土', '官鬼午火', '兄弟申金', '官鬼午火', '兄弟申金', '父母戌土', 4, 1, '', '游魂卦', '兑宫', '雷山小过'], '112122': ['官鬼巳火', '妻财卯木', '父母丑土', '官鬼午火', '兄弟申金', '父母戌土', 3, 6, '', '归魂卦', '兑宫', '雷泽归妹'], '121121': ['父母卯木', '子孙丑土', '官鬼亥水', '妻财酉金', '子孙未土', '兄弟巳火', 6, 3, '六冲', '', '离宫', '离为火'], '221121': ['子孙丑土', '官鬼亥水', '妻财申金', '妻财酉金', '子孙未土', '兄弟巳火', 1, 4, '六合', '', '离宫', '火山旅'], '211121': ['子孙丑土', '官鬼亥水', '妻财酉金', '妻财酉金', '子孙未土', '兄弟巳火', 2, 5, '', '', '离宫', '火风鼎'], '212121': ['父母寅木', '子孙辰土', '兄弟午火', '妻财酉金', '子孙未土', '兄弟巳火', 3, 6, '', '', '离宫', '火水未济'], '212221': ['父母寅木', '子孙辰土', '兄弟午火', '子孙戌土', '官鬼子水', '父母寅木', 4, 1, '', '', '离宫', '山水蒙'], '212211': ['父母寅木', '子孙辰土', '兄弟午火', '子孙未土', '兄弟巳火', '父母卯木', 5, 2, '', '', '离宫', '风水涣'], '212111': ['父母寅木', '子孙辰土', '兄弟午火', '兄弟午火', '妻财申金', '子孙戌土', 4, 1, '', '游魂卦', '离宫', '天水讼'], '121111': ['父母卯木', '子孙辰土', '官鬼亥水', '兄弟午火', '妻财申金', '子孙戌土', 3, 6, '', '归魂卦', '离宫', '天火同人'], '122122': ['父母子水', '兄弟寅木', '妻财辰土', '子孙午火', '官鬼申金', '妻财戌土', 6, 3, '六冲', '', '震宫', '震为雷'], '222122': ['妻财未土', '子孙巳火', '兄弟卯木', '子孙午火', '官鬼申金', '妻财戌土', 1, 4, '六合', '', '震宫', '雷地豫'], '212122': ['兄弟寅木', '妻财辰土', '子孙午火', '子孙午火', '官鬼申金', '妻财戌土', 2, 5, '', '', '震宫', '雷水解'], '211122': ['妻财丑土', '父母亥水', '官鬼酉金', '子孙午火', '官鬼申金', '妻财戌土', 3, 6, '', '', '震宫', '雷风恒'], '211222': ['妻财辰土', '子孙午火', '官鬼申金', '妻财丑土', '父母亥水', '兄弟酉金', 3, 6, '', '', '震宫', '地风升'], '211212': ['妻财辰土', '父母亥水', '官鬼酉金', '官鬼申金', '妻财戌土', '父母子水', 5, 2, '', '', '震宫', '水风井'], '211112': ['妻财丑土', '父母亥水', '官鬼酉金', '父母亥水', '官鬼酉金', '妻财未土', 4, 1, '', '游魂卦', '震宫', '泽风大过'], '122112': ['父母子水', '兄弟寅木', '妻财辰土', '父母亥水', '官鬼酉金', '妻财未土', 3, 6, '', '归魂卦', '震宫', '泽雷随'], '211211': ['妻财丑土', '父母亥水', '官鬼酉金', '妻财未土', '子孙巳火', '兄弟卯木', 6, 3, '六冲', '', '巽宫', '巽为风'], '111211': ['父母子水', '兄弟寅木', '妻财辰土', '妻财未土', '子孙巳火', '兄弟卯木', 1, 4, '', '', '巽宫', '风天小畜'], '121211': ['兄弟卯木', '妻财丑土', '父母亥水', '妻财未土', '子孙巳火', '兄弟卯木', 2, 5, '', '', '巽宫', '风火家人'], '122211': ['父母子水', '兄弟寅木', '妻财辰土', '妻财未土', '子孙巳火', '兄弟卯木', 3, 6, '', '', '巽宫', '风雷益'], '122111': ['父母子水', '兄弟寅木', '妻财辰土', '子孙午火', '官鬼申金', '妻财戌土', 4, 1, '六冲', '', '巽宫', '天雷无妄'], '122121': ['父母子水', '兄弟寅木', '妻财辰土', '官鬼酉金', '妻财未土', '子孙巳火', 5, 2, '', '', '巽宫', '火雷噬嗑'], '122221': ['父母子水', '兄弟寅木', '妻财辰土', '妻财戌土', '父母子水', '兄弟寅木', 4, 1, '', '游魂卦', '巽宫', '山雷颐'], '211221': ['妻财丑土', '父母亥水', '官鬼酉金', '妻财戌土', '父母子水', '兄弟寅木', 3, 6, '', '归魂卦', '巽宫', '山风蛊'], '212212': ['子孙寅木', '官鬼辰土', '妻财午火', '父母申金', '官鬼戌土', '兄弟子水', 6, 3, '六冲', '', '坎宫', '坎为水'], '112212': ['妻财巳火', '子孙卯木', '官鬼丑土', '父母申金', '官鬼戌土', '兄弟子水', 1, 4, '六合', '', '坎宫', '水泽节'], '122212': ['兄弟子水', '子孙寅木', '官鬼辰土', '父母申金', '官鬼戌土', '兄弟子水', 2, 5, '', '', '坎宫', '水雷屯'], '121212': ['子孙卯木', '官鬼丑土', '兄弟亥水', '父母申金', '官鬼戌土', '兄弟子水', 3, 6, '', '', '坎宫', '水火既济'], '121112': ['子孙卯木', '官鬼丑土', '兄弟亥水', '兄弟亥水', '父母酉金', '官鬼未土', 4, 1, '', '', '坎宫', '泽火革'], '121122': ['子孙卯木', '官鬼丑土', '兄弟亥水', '妻财午火', '父母申金', '官鬼戌土', 5, 2, '', '', '坎宫', '雷火丰'], '121222': ['子孙卯木', '官鬼丑土', '兄弟亥水', '官鬼丑土', '兄弟亥水', '父母酉金', 4, 1, '', '游魂卦', '坎宫', '地火明夷'], '212222': ['子孙寅木', '官鬼辰土', '妻财午火', '官鬼丑土', '兄弟亥水', '父母酉金', 3, 6, '', '归魂卦', '坎宫', '地水师'], '221221': ['兄弟辰土', '父母午火', '子孙申金', '兄弟戌土', '妻财子水', '官鬼寅木', 6, 3, '六冲', '', '艮宫', '艮为山'], '121221': ['官鬼卯木', '兄弟丑土', '妻财亥水', '兄弟戌土', '妻财子水', '官鬼寅木', 1, 4, '六合', '', '艮宫', '山火贲'], '111221': ['妻财子水', '官鬼寅木', '兄弟辰土', '兄弟戌土', '妻财子水', '官鬼寅木', 2, 5, '', '', '艮宫', '山天大畜'], '112221': ['父母巳火', '官鬼卯木', '兄弟丑土', '兄弟戌土', '妻财子水', '官鬼寅木', 3, 6, '', '', '艮宫', '山泽损'], '112121': ['父母巳火', '官鬼卯木', '兄弟丑土', '子孙酉金', '兄弟未土', '父母巳火', 4, 1, '', '', '艮宫', '火泽睽'], '112111': ['父母巳火', '官鬼卯木', '兄弟丑土', '父母午火', '子孙申金', '兄弟戌土', 5, 2, '', '', '艮宫', '天泽履'], '112211': ['父母巳火', '官鬼卯木', '兄弟丑土', '兄弟未土', '父母巳火', '官鬼卯木', 4, 1, '', '游魂卦', '艮宫', '风泽中孚'], '221211': ['兄弟辰土', '父母午火', '子孙申金', '兄弟未土', '父母巳火', '官鬼卯木', 3, 6, '', '归魂卦', '艮宫', '风山渐'], '222222': ['兄弟未土', '父母巳火', '官鬼卯木', '兄弟丑土', '妻财亥水', '子孙酉金', 1, 4, '六冲', '', '坤宫', '坤为地'], '122222': ['妻财子水', '官鬼寅木', '兄弟辰土', '兄弟丑土', '妻财亥水', '子孙酉金', 6, 3, '六合', '', '坤宫', '地雷复'], '112222': ['父母巳火', '官鬼卯木', '兄弟丑土', '兄弟丑土', '妻财亥水', '子孙酉金', 2, 5, '', '', '坤宫', '地泽临'], '111222': ['妻财子水', '官鬼寅木', '兄弟辰土', '兄弟丑土', '妻财亥水', '子孙酉金', 3, 6, '六合', '', '坤宫', '地天泰'], '111122': ['妻财子水', '官鬼寅木', '兄弟辰土', '父母午火', '子孙申金', '兄弟戌土', 4, 1, '六冲', '', '坤宫', '雷天大壮'], '111112': ['妻财子水', '官鬼寅木', '兄弟辰土', '妻财亥水', '子孙酉金', '兄弟未土', 5, 2, '', '', '坤宫', '泽天夬'], '111212': ['妻财子水', '官鬼寅木', '兄弟辰土', '子孙申金', '兄弟戌土', '妻财子水', 4, 1, '', '游魂卦', '坤宫', '水天需'], '222212': ['兄弟未土', '父母巳火', '官鬼卯木', '子孙申金', '兄弟戌土', '妻财子水', 3, 6, '', '归魂卦', '坤宫', '水地比']}
cangyao64 = {'111111': ['', '', '', '', '', ''], '211111': ['', '妻财寅木', '', '', '', ''], '221111': ['子孙子水', '妻财寅木', '', '', '', ''], '222111': ['子孙子水', '', '', '', '', ''], '222211': ['子孙子水', '', '', '', '兄弟申金', ''], '222221': ['', '', '', '', '兄弟申金', ''], '222121': ['子孙子水', '', '', '', '', ''], '111121': ['', '', '', '', '', ''], '112112': ['', '', '', '', '', ''], '212112': ['', '', '', '', '', ''], '222112': ['', '', '', '', '', ''], '221112': ['', '妻财卯木', '', '', '', ''], '221212': ['', '妻财卯木', '', '', '', ''], '221222': ['', '妻财卯木', '', '', '', ''], '221122': ['', '妻财卯木', '', '子孙亥水', '', ''], '112122': ['', '', '', '子孙亥水', '', ''], '121121': ['', '', '', '', '', ''], '221121': ['父母卯木', '', '官鬼亥水', '', '', ''], '211121': ['父母卯木', '', '', '', '', ''], '212121': ['', '', '官鬼亥水', '', '', ''], '212221': ['', '', '', '妻财酉金', '', ''], '212211': ['', '', '官鬼亥水', '妻财酉金', '', ''], '212111': ['', '', '官鬼亥水', '', '', ''], '121111': ['', '', '', '', '', ''], '122122': ['', '', '', '', '', ''], '222122': ['父母子水', '', '', '', '', ''], '212122': ['父母子水', '', '', '', '', ''], '211122': ['', '兄弟寅木', '', '', '', ''], '211222': ['', '兄弟寅木', '', '子孙午火', '', ''], '211212': ['', '兄弟寅木', '', '子孙午火', '', ''], '211112': ['', '兄弟寅木', '', '子孙午火', '', ''], '122112': ['', '', '', '子孙午火', '', ''], '211211': ['', '', '', '', '', ''], '111211': ['', '', '官鬼酉金', '', '', ''], '121211': ['', '', '官鬼酉金', '', '', ''], '122211': ['', '', '官鬼酉金', '', '', ''], '122111': ['', '', '', '', '', ''], '122121': ['', '', '', '', '', ''], '122221': ['', '', '官鬼酉金', '', '子孙巳火', ''], '211221': ['', '', '', '', '子孙巳火', ''], '212212': ['', '', '', '', '', ''], '112212': ['', '', '', '', '', ''], '122212': ['', '', '妻财午火', '', '', ''], '121212': ['', '', '妻财午火', '', '', ''], '121112': ['', '', '妻财午火', '', '', ''], '121122': ['', '', '', '', '', ''], '121222': ['', '', '妻财午火', '', '', ''], '212222': ['', '', '', '', '', ''], '221221': ['', '', '', '', '', ''], '121221': ['', '父母午火', '子孙申金', '', '', ''], '111221': ['兄弟辰土', '父母午火', '', '', '', ''], '112221': ['', '', '子孙申金', '', '', ''], '112121': ['', '', '子孙申金', '', '妻财子水', ''], '112111': ['', '', '', '', '妻财子水', ''], '112211': ['', '', '子孙申金', '', '妻财子水', ''], '221211': ['', '', '', '', '妻财子水', ''], '222222': ['', '', '', '', '', ''], '122222': ['', '父母巳火', '', '', '', ''], '112222': ['', '', '', '', '', ''], '111222': ['', '父母巳火', '', '', '', ''], '111122': ['', '', '', '', '', ''], '111112': ['', '父母巳火', '', '', '', ''], '111212': ['', '父母巳火', '', '', '', ''], '222212': ['', '', '', '', '', '']}


# Recovered from pyc
gua64 = {'111111': ['子孙子水', '妻财寅木', '父母辰土', '官鬼午火', '兄弟申金', '父母戌土', 6, 3, '六冲', '', '乾宫', '乾为天'], '211111': ['父母丑土', '子孙亥水', '兄弟酉金', '官鬼午火', '兄弟申金', '父母戌土', 1, 4, '', '', '乾宫', '天风姤'], '221111': ['父母辰土', '官鬼午火', '兄弟申金', '官鬼午火', '兄弟申金', '父母戌土', 2, 5, '', '', '乾宫', '天山遁'], '222111': ['父母未土', '官鬼巳火', '妻财卯木', '官鬼午火', '兄弟申金', '父母戌土', 3, 6, '六合', '', '乾宫', '天地否'], '222211': ['父母未土', '官鬼巳火', '妻财卯木', '父母未土', '官鬼巳火', '妻财卯木', 4, 1, '', '', '乾宫', '风地观'], '222221': ['父母未土', '官鬼巳火', '妻财卯木', '父母戌土', '子孙子水', '妻财寅木', 5, 2, '', '', '乾宫', '山地剥'], '222121': ['父母未土', '官鬼巳火', '妻财卯木', '兄弟酉金', '父母未土', '官鬼巳火', 4, 1, '', '游魂卦', '乾宫', '火地晋'], '111121': ['子孙子水', '妻财寅木', '父母辰土', '兄弟酉金', '父母未土', '官鬼巳火', 3, 6, '', '归魂卦', '乾宫', '火天大有'], '112112': ['官鬼巳火', '妻财卯木', '父母丑土', '子孙亥水', '兄弟酉金', '父母未土', 6, 3, '六冲', '', '兑宫', '兑为泽'], '212112': ['妻财寅木', '父母辰土', '官鬼午火', '子孙亥水', '兄弟酉金', '父母未土', 1, 4, '六合', '', '兑宫', '泽水困'], '222112': ['父母未土', '官鬼巳火', '妻财卯木', '子孙亥水', '兄弟酉金', '父母未土', 2, 5, '', '', '兑宫', '泽地萃'], '221112': ['父母辰土', '官鬼午火', '兄弟申金', '子孙亥水', '兄弟酉金', '父母未土', 3, 6, '', '', '兑宫', '泽山咸'], '221212': ['父母辰土', '官鬼午火', '兄弟申金', '兄弟申金', '父母戌土', '子孙子水', 4, 1, '', '', '兑宫', '水山蹇'], '221222': ['父母辰土', '官鬼午火', '兄弟申金', '父母丑土', '子孙亥水', '兄弟酉金', 5, 2, '', '', '兑宫', '地山谦'], '221122': ['父母辰土', '官鬼午火', '兄弟申金', '官鬼午火', '兄弟申金', '父母戌土', 4, 1, '', '游魂卦', '兑宫', '雷山小过'], '112122': ['官鬼巳火', '妻财卯木', '父母丑土', '官鬼午火', '兄弟申金', '父母戌土', 3, 6, '', '归魂卦', '兑宫', '雷泽归妹'], '121121': ['父母卯木', '子孙丑土', '官鬼亥水', '妻财酉金', '子孙未土', '兄弟巳火', 6, 3, '六冲', '', '离宫', '离为火'], '221121': ['子孙丑土', '官鬼亥水', '妻财申金', '妻财酉金', '子孙未土', '兄弟巳火', 1, 4, '六合', '', '离宫', '火山旅'], '211121': ['子孙丑土', '官鬼亥水', '妻财酉金', '妻财酉金', '子孙未土', '兄弟巳火', 2, 5, '', '', '离宫', '火风鼎'], '212121': ['父母寅木', '子孙辰土', '兄弟午火', '妻财酉金', '子孙未土', '兄弟巳火', 3, 6, '', '', '离宫', '火水未济'], '212221': ['父母寅木', '子孙辰土', '兄弟午火', '子孙戌土', '官鬼子水', '父母寅木', 4, 1, '', '', '离宫', '山水蒙'], '212211': ['父母寅木', '子孙辰土', '兄弟午火', '子孙未土', '兄弟巳火', '父母卯木', 5, 2, '', '', '离宫', '风水涣'], '212111': ['父母寅木', '子孙辰土', '兄弟午火', '兄弟午火', '妻财申金', '子孙戌土', 4, 1, '', '游魂卦', '离宫', '天水讼'], '121111': ['父母卯木', '子孙辰土', '官鬼亥水', '兄弟午火', '妻财申金', '子孙戌土', 3, 6, '', '归魂卦', '离宫', '天火同人'], '122122': ['父母子水', '兄弟寅木', '妻财辰土', '子孙午火', '官鬼申金', '妻财戌土', 6, 3, '六冲', '', '震宫', '震为雷'], '222122': ['妻财未土', '子孙巳火', '兄弟卯木', '子孙午火', '官鬼申金', '妻财戌土', 1, 4, '六合', '', '震宫', '雷地豫'], '212122': ['兄弟寅木', '妻财辰土', '子孙午火', '子孙午火', '官鬼申金', '妻财戌土', 2, 5, '', '', '震宫', '雷水解'], '211122': ['妻财丑土', '父母亥水', '官鬼酉金', '子孙午火', '官鬼申金', '妻财戌土', 3, 6, '', '', '震宫', '雷风恒'], '211222': ['妻财辰土', '子孙午火', '官鬼申金', '妻财丑土', '父母亥水', '兄弟酉金', 3, 6, '', '', '震宫', '地风升'], '211212': ['妻财辰土', '父母亥水', '官鬼酉金', '官鬼申金', '妻财戌土', '父母子水', 5, 2, '', '', '震宫', '水风井'], '211112': ['妻财丑土', '父母亥水', '官鬼酉金', '父母亥水', '官鬼酉金', '妻财未土', 4, 1, '', '游魂卦', '震宫', '泽风大过'], '122112': ['父母子水', '兄弟寅木', '妻财辰土', '父母亥水', '官鬼酉金', '妻财未土', 3, 6, '', '归魂卦', '震宫', '泽雷随'], '211211': ['妻财丑土', '父母亥水', '官鬼酉金', '妻财未土', '子孙巳火', '兄弟卯木', 6, 3, '六冲', '', '巽宫', '巽为风'], '111211': ['父母子水', '兄弟寅木', '妻财辰土', '妻财未土', '子孙巳火', '兄弟卯木', 1, 4, '', '', '巽宫', '风天小畜'], '121211': ['兄弟卯木', '妻财丑土', '父母亥水', '妻财未土', '子孙巳火', '兄弟卯木', 2, 5, '', '', '巽宫', '风火家人'], '122211': ['父母子水', '兄弟寅木', '妻财辰土', '妻财未土', '子孙巳火', '兄弟卯木', 3, 6, '', '', '巽宫', '风雷益'], '122111': ['父母子水', '兄弟寅木', '妻财辰土', '子孙午火', '官鬼申金', '妻财戌土', 4, 1, '六冲', '', '巽宫', '天雷无妄'], '122121': ['父母子水', '兄弟寅木', '妻财辰土', '官鬼酉金', '妻财未土', '子孙巳火', 5, 2, '', '', '巽宫', '火雷噬嗑'], '122221': ['父母子水', '兄弟寅木', '妻财辰土', '妻财戌土', '父母子水', '兄弟寅木', 4, 1, '', '游魂卦', '巽宫', '山雷颐'], '211221': ['妻财丑土', '父母亥水', '官鬼酉金', '妻财戌土', '父母子水', '兄弟寅木', 3, 6, '', '归魂卦', '巽宫', '山风蛊'], '212212': ['子孙寅木', '官鬼辰土', '妻财午火', '父母申金', '官鬼戌土', '兄弟子水', 6, 3, '六冲', '', '坎宫', '坎为水'], '112212': ['妻财巳火', '子孙卯木', '官鬼丑土', '父母申金', '官鬼戌土', '兄弟子水', 1, 4, '六合', '', '坎宫', '水泽节'], '122212': ['兄弟子水', '子孙寅木', '官鬼辰土', '父母申金', '官鬼戌土', '兄弟子水', 2, 5, '', '', '坎宫', '水雷屯'], '121212': ['子孙卯木', '官鬼丑土', '兄弟亥水', '父母申金', '官鬼戌土', '兄弟子水', 3, 6, '', '', '坎宫', '水火既济'], '121112': ['子孙卯木', '官鬼丑土', '兄弟亥水', '兄弟亥水', '父母酉金', '官鬼未土', 4, 1, '', '', '坎宫', '泽火革'], '121122': ['子孙卯木', '官鬼丑土', '兄弟亥水', '妻财午火', '父母申金', '官鬼戌土', 5, 2, '', '', '坎宫', '雷火丰'], '121222': ['子孙卯木', '官鬼丑土', '兄弟亥水', '官鬼丑土', '兄弟亥水', '父母酉金', 4, 1, '', '游魂卦', '坎宫', '地火明夷'], '212222': ['子孙寅木', '官鬼辰土', '妻财午火', '官鬼丑土', '兄弟亥水', '父母酉金', 3, 6, '', '归魂卦', '坎宫', '地水师'], '221221': ['兄弟辰土', '父母午火', '子孙申金', '兄弟戌土', '妻财子水', '官鬼寅木', 6, 3, '六冲', '', '艮宫', '艮为山'], '121221': ['官鬼卯木', '兄弟丑土', '妻财亥水', '兄弟戌土', '妻财子水', '官鬼寅木', 1, 4, '六合', '', '艮宫', '山火贲'], '111221': ['妻财子水', '官鬼寅木', '兄弟辰土', '兄弟戌土', '妻财子水', '官鬼寅木', 2, 5, '', '', '艮宫', '山天大畜'], '112221': ['父母巳火', '官鬼卯木', '兄弟丑土', '兄弟戌土', '妻财子水', '官鬼寅木', 3, 6, '', '', '艮宫', '山泽损'], '112121': ['父母巳火', '官鬼卯木', '兄弟丑土', '子孙酉金', '兄弟未土', '父母巳火', 4, 1, '', '', '艮宫', '火泽睽'], '112111': ['父母巳火', '官鬼卯木', '兄弟丑土', '父母午火', '子孙申金', '兄弟戌土', 5, 2, '', '', '艮宫', '天泽履'], '112211': ['父母巳火', '官鬼卯木', '兄弟丑土', '兄弟未土', '父母巳火', '官鬼卯木', 4, 1, '', '游魂卦', '艮宫', '风泽中孚'], '221211': ['兄弟辰土', '父母午火', '子孙申金', '兄弟未土', '父母巳火', '官鬼卯木', 3, 6, '', '归魂卦', '艮宫', '风山渐'], '222222': ['兄弟未土', '父母巳火', '官鬼卯木', '兄弟丑土', '妻财亥水', '子孙酉金', 1, 4, '六冲', '', '坤宫', '坤为地'], '122222': ['妻财子水', '官鬼寅木', '兄弟辰土', '兄弟丑土', '妻财亥水', '子孙酉金', 6, 3, '六合', '', '坤宫', '地雷复'], '112222': ['父母巳火', '官鬼卯木', '兄弟丑土', '兄弟丑土', '妻财亥水', '子孙酉金', 2, 5, '', '', '坤宫', '地泽临'], '111222': ['妻财子水', '官鬼寅木', '兄弟辰土', '兄弟丑土', '妻财亥水', '子孙酉金', 3, 6, '六合', '', '坤宫', '地天泰'], '111122': ['妻财子水', '官鬼寅木', '兄弟辰土', '父母午火', '子孙申金', '兄弟戌土', 4, 1, '六冲', '', '坤宫', '雷天大壮'], '111112': ['妻财子水', '官鬼寅木', '兄弟辰土', '妻财亥水', '子孙酉金', '兄弟未土', 5, 2, '', '', '坤宫', '泽天夬'], '111212': ['妻财子水', '官鬼寅木', '兄弟辰土', '子孙申金', '兄弟戌土', '妻财子水', 4, 1, '', '游魂卦', '坤宫', '水天需'], '222212': ['兄弟未土', '父母巳火', '官鬼卯木', '子孙申金', '兄弟戌土', '妻财子水', 3, 6, '', '归魂卦', '坤宫', '水地比']}
cangyao64 = {'111111': ['', '', '', '', '', ''], '211111': ['', '妻财寅木', '', '', '', ''], '221111': ['子孙子水', '妻财寅木', '', '', '', ''], '222111': ['子孙子水', '', '', '', '', ''], '222211': ['子孙子水', '', '', '', '兄弟申金', ''], '222221': ['', '', '', '', '兄弟申金', ''], '222121': ['子孙子水', '', '', '', '', ''], '111121': ['', '', '', '', '', ''], '112112': ['', '', '', '', '', ''], '212112': ['', '', '', '', '', ''], '222112': ['', '', '', '', '', ''], '221112': ['', '妻财卯木', '', '', '', ''], '221212': ['', '妻财卯木', '', '', '', ''], '221222': ['', '妻财卯木', '', '', '', ''], '221122': ['', '妻财卯木', '', '子孙亥水', '', ''], '112122': ['', '', '', '子孙亥水', '', ''], '121121': ['', '', '', '', '', ''], '221121': ['父母卯木', '', '官鬼亥水', '', '', ''], '211121': ['父母卯木', '', '', '', '', ''], '212121': ['', '', '官鬼亥水', '', '', ''], '212221': ['', '', '', '妻财酉金', '', ''], '212211': ['', '', '官鬼亥水', '妻财酉金', '', ''], '212111': ['', '', '官鬼亥水', '', '', ''], '121111': ['', '', '', '', '', ''], '122122': ['', '', '', '', '', ''], '222122': ['父母子水', '', '', '', '', ''], '212122': ['父母子水', '', '', '', '', ''], '211122': ['', '兄弟寅木', '', '', '', ''], '211222': ['', '兄弟寅木', '', '子孙午火', '', ''], '211212': ['', '兄弟寅木', '', '子孙午火', '', ''], '211112': ['', '兄弟寅木', '', '子孙午火', '', ''], '122112': ['', '', '', '子孙午火', '', ''], '211211': ['', '', '', '', '', ''], '111211': ['', '', '官鬼酉金', '', '', ''], '121211': ['', '', '官鬼酉金', '', '', ''], '122211': ['', '', '官鬼酉金', '', '', ''], '122111': ['', '', '', '', '', ''], '122121': ['', '', '', '', '', ''], '122221': ['', '', '官鬼酉金', '', '子孙巳火', ''], '211221': ['', '', '', '', '子孙巳火', ''], '212212': ['', '', '', '', '', ''], '112212': ['', '', '', '', '', ''], '122212': ['', '', '妻财午火', '', '', ''], '121212': ['', '', '妻财午火', '', '', ''], '121112': ['', '', '妻财午火', '', '', ''], '121122': ['', '', '', '', '', ''], '121222': ['', '', '妻财午火', '', '', ''], '212222': ['', '', '', '', '', ''], '221221': ['', '', '', '', '', ''], '121221': ['', '父母午火', '子孙申金', '', '', ''], '111221': ['兄弟辰土', '父母午火', '', '', '', ''], '112221': ['', '', '子孙申金', '', '', ''], '112121': ['', '', '子孙申金', '', '妻财子水', ''], '112111': ['', '', '', '', '妻财子水', ''], '112211': ['', '', '子孙申金', '', '妻财子水', ''], '221211': ['', '', '', '', '妻财子水', ''], '222222': ['', '', '', '', '', ''], '122222': ['', '父母巳火', '', '', '', ''], '112222': ['', '', '', '', '', ''], '111222': ['', '父母巳火', '', '', '', ''], '111122': ['', '', '', '', '', ''], '111112': ['', '父母巳火', '', '', '', ''], '111212': ['', '父母巳火', '', '', '', ''], '222212': ['', '', '', '', '', '']}
